requests/writeData.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.e-controlnet.de/services/vii/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <WriteData>
      <Wert>
        <![CDATA[{value}]]>
      </Wert>
      <AnlageId>
        <![CDATA[{anlageId}]]>
      </AnlageId>
      <GeraetId>
        <![CDATA[{geraetId}]]>
      </GeraetId>
      <DatapointId>
        <![CDATA[{datapoint}]]>
      </DatapointId>
    </WriteData>
  </soap:Body>
</soap:Envelope>
